DigiTorus86/ESP32-R4ge-Pro/PlatformIO/esp32-r4ge-pro-tombstone/src/main.cpp
/***************************************************
* ESP32 Badge "Tombstone City: 21st Century" game
* An emulation of the classic TI-994/A game by John Plaster for Texas Instruments 
* *
* Requires:
* - ESP32 R4ge Pro 
* - ESP8266Audio library:  https://github.com/earlephilhower/ESP8266Audio 
*    When using IDF >= 4.2.0, need to change AudioOutputI2s.cpp line 91 to:
*   .mck_io_num = I2S_PIN_NO_CHANGE
*   ...otherwise audio won't work right due to MCLK pin changes.

Copyright (c) 2020 Paul Pagel
This is free software; see the license.txt file for more information.
There is no warranty; not even for merchantability or fitness for a particular purpose.
****************************************************/

#include <Arduino.h>
#include <SD.h>
#include "esp32_r4ge_pro.h"
#include <WiFi.h>
#include "AudioFileSourcePROGMEM.h"
#include "AudioGeneratorWAV.h"
#include "AudioOutputI2S.h"

#include "explosion_wav.h"
#include "fire_wav.h"
#include "life_wav.h"
#include "boop_wav.h"
#include "theme_wav.h"
#include "Tombstone_title.h" 
#include "Tiles.h" 

// ---- Game Settings and Variables ----

#define DIRT_COLOR  0xFEF1
#define BROWN_COLOR 0x7980

#define TILE_SIZE      10
#define TITLE_HT       30
#define TITLE_WD       280
#define BORDER_TOP     10
#define BORDER_LEFT    20
#define BORDER_BOTTOM  SCREEN_HT - 10
#define BORDER_RIGHT   SCREEN_WD - 20
#define STATUS_TOP     GAME_BOTTOM  //BORDER_BOTTOM - 20
#define STATUS_HT      20
#define GAME_ROWS      17
#define GAME_COLS      28
#define GAME_TOP       BORDER_TOP + TITLE_HT
#define GAME_LEFT      BORDER_LEFT
#define GAME_BOTTOM    GAME_TOP + GAME_ROWS * TILE_SIZE
#define GAME_RIGHT     GAME_LEFT + GAME_COLS * TILE_SIZE
#define GAME_HT        GAME_BOTTOM - GAME_TOP
#define GAME_WD        GAME_RIGHT - GAME_LEFT
#define MAX_SPEED      20  // for morg or tumbleweed movement, higher value makes game easier

enum tile_type {
  TILE_UNKNOWN,
  TILE_EMPTY,
  TILE_PLAYER,
  TILE_SHOT,
  TILE_BLOCK,
  TILE_CACTUS,
  TILE_CACTUS_ACTIVE,
  TILE_TUMBLEWEED,
  TILE_MORG,
  TILE_EXPLOSION
};

enum game_state_type {
  STATE_TITLE,
  STATE_RULES,
  STATE_PLAYING,
  STATE_PAUSED,
  STATE_GAME_OVER
};

enum direction_type {
  DIR_UP,
  DIR_DOWN,
  DIR_LEFT,
  DIR_RIGHT
};

enum     game_state_type game_state;
int      difficulty, day, population, schooners;
uint8_t  player_row, player_col, player_dir;
uint8_t  shot_row, shot_col;
int      shot_row_chg, shot_col_chg;
bool     shot_active, shot_is_new;
uint8_t  game_grid[GAME_ROWS * GAME_COLS];
uint16_t spawn_counter, spawn_signal, spawn_max;
int      spawn_row, spawn_col;
uint8_t  morg_speed, tumbleweed_speed;

bool btn_was_pressed[8], btn_pressed[8], btn_released[8];
int16_t joy_x_left, joy_y_left, joy_x_right, joy_y_right; 

AudioGeneratorWAV *wav;
AudioFileSourcePROGMEM *fire_file;
AudioFileSourcePROGMEM *explosion_file;
AudioFileSourcePROGMEM *life_file;
AudioFileSourcePROGMEM *boop_file;
AudioFileSourcePROGMEM *theme_file;
AudioOutputI2S *out;

Adafruit_ILI9341 tft = Adafruit_ILI9341(TFT_CS, TFT_DC, TFT_MOSI, TFT_CLK, TFT_RST, TFT_MISO);

// ---- Function Prototypes ----
void    setup(); 
void    drawBackground();
void    drawTitleScreen();
void    drawRulesScreen();
void    drawGameScreen();
void    drawDay();
void    drawPopulation();
void    drawSchooners();
void    drawPaused();
void    erasePaused();
void    drawGameOver();
void    drawCity(bool active);
void    drawPlayer();
void    movePlayer(uint8_t moveDirection, int rowChg, int colChg);
void    moveMorg(int gridIndex);
void    moveTumbleweed(int gridIndex);
void    doMovement();
int     getNeighborTile(int row, int col, uint8_t tile, bool allowInCity);
int     getNeighborTileEx(int row, int col, uint8_t tile, bool allowInCity, int excludeRow, int excludeCol);
void    spawnMorg();
void    prepareSpawn();
void    doSpawning();
int     getSpawnCount();
void    checkCactusTriplet(int row, int col);
void    playShot();
void    playExplosion();
void    playBoop();
void    playNextDaySong();
void    playThemeSong();
void    killPlayer();
void    playerShoot();
void    playerPanic();
void    moveShot();
void    addCacti(uint8_t count);
void    addSpawnCacti(uint8_t count);
void    addTumbleweeds(uint8_t count);
void    addMorgs(uint8_t count);
bool    isOutOfBounds(int row, int col);
bool    isInBounds(int row, int col, bool allowInCity);
bool    isInCity(int row, int col);
bool    isOccupied(int row, int col);
uint8_t getGridIndex(int row, int col);
uint8_t getTileType(int row, int col);
void    setTileType(int row, int col, uint8_t tile, bool draw);
void    setTextColor(uint16_t color, bool inverted);
void    initGame();
void    playerStart();
void    advanceDay();
void    checkButtonPresses();
void    checkJoysticks();
void    checkAudio();
void    delayAudio(long ms);
void    loop(void);
void    handleTitle();
void    handleRules();
void    handlePlaying();
void    handlePaused();
void    handleGameOver();

/*
 * Initialize the board hardware and software on startup
 */
void setup() 
{
  WiFi.mode(WIFI_OFF); 
  Serial.begin(9600);
  Serial.println("\nESP32 Badge - Tombstone City"); 
  delay(100);

  Serial.print("Setting up pins..."); 
  pinMode(ESP_LED, OUTPUT);  // built-in blue LED on NodeMCU

  // Set up shift register pins
  pinMode(SR_PL, OUTPUT);
  pinMode(SR_CP, OUTPUT);   
  pinMode(SR_Q7, INPUT);

  // Set up the SPI CS output pins
  pinMode(TFT_CS, OUTPUT);
  pinMode(TCH_CS, OUTPUT);
  pinMode(SD_CS, OUTPUT);

  pinMode(TFT_LED, OUTPUT);
  digitalWrite(TFT_LED, LOW); // full brightness
  
  // Set up the joysticks
  pinMode(JOYX_L, INPUT);
  pinMode(JOYY_L, INPUT);
  pinMode(JOYX_R, INPUT);
  pinMode(JOYY_R, INPUT);
  
  Serial.println("done"); 
  delay(100);
 
  Serial.print("Setting display..."); 
  tft.begin();
  tft.setRotation(SCREEN_ROT);

  Serial.println("done"); 
  delay(100);

  Serial.print("Setting audio..."); 

  audioLogger = &Serial;
  explosion_file = new AudioFileSourcePROGMEM(explosion_wav, sizeof(explosion_wav));
  fire_file = new AudioFileSourcePROGMEM(fire_wav, sizeof(fire_wav));
  life_file = new AudioFileSourcePROGMEM(life_wav, sizeof(life_wav));
  boop_file = new AudioFileSourcePROGMEM(boop_wav, sizeof(boop_wav));
  theme_file = new AudioFileSourcePROGMEM(theme_wav, sizeof(theme_wav));
  out = new AudioOutputI2S();
  out->SetPinout(I2S_BCLK, I2S_LRCK, I2S_DOUT);
  wav = new AudioGeneratorWAV();

  Serial.println("done"); 

  initGame();
  drawBackground();
  drawTitleScreen();
}

